# string methods

In [4]:
a= "Pakistan Zindabad"

print(a)
print(dir(a))

Pakistan Zindabad
['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__getstate__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'capitalize', 'casefold', 'center', 'count', 'encode', 'endswith', 'expandtabs', 'find', 'format', 'format_map', 'index', 'isalnum', 'isalpha', 'isascii', 'isdecimal', 'isdigit', 'isidentifier', 'islower', 'isnumeric', 'isprintable', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'maketrans', 'partition', 'removeprefix', 'removesuffix', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']

In [10]:
a="""
my name is ISra Raza.
aNd I love My country.
"""

print(a.capitalize())

my name is isra raza.
and i love my country.

In [11]:
a="""
my name is ISra Raza.
aNd I love My country.
"""

print(a.casefold())

my name is isra raza.
and i love my country.

In [7]:
a="""Pakistan zindabad
we love our country"""

print(a.casefold())

pakistan zindabad
we love our country

In [13]:
name= "Syeda Isra Raza"

print(len(name))

15

In [15]:
name= "Syeda Isra Raza"

print(name.__len__())

15

In [14]:
name= "Syeda Isra Raza"

name.center(20)

'  Syeda Isra Raza   '

In [1]:
name= "Syeda Isra Raza"

name.count("a")

4

In [5]:
name= "syeda Isra Raza, syeda bushra, syed muhammad"

name.count("syeda")

2

In [7]:
name= "Syeda Isra Raza"
name=name.casefold()
 
name.count("s")

2

In [10]:
name= "Syeda Isra Raza"
name=name.casefold()

print(name.count("a"))
print(name.count("s"))

4
2

# press tab and type 65 will show A

UTF-8 codes ascii  encoding codes

In [11]:
txt = "My name is St√•le" #special a so encoding it

x = txt.encode()

print(x)

b'My name is St\xc3\xa5le'

In [13]:
name= "Syeda Isra Raza"

print(name.endswith("a"))
print(name.endswith("za"))

True
True

In [16]:
name= "syeda Isra Raza"

print(name.startswith("s"))
print(name.startswith("a"))

True
False

In [19]:
name= "syeda Isra Raza"
search=input("start with ")
print(name.startswith(search))

start with a
False

In [20]:
xyz="""
Name:\tIsra
employee:\tHMB
employee id:\t13615
designation:\tBusiness Analyst:

"""

print(xyz)

Name:	Isra
employee:	HMB
employee id:	13615
designation:	Business Analyst:

In [22]:
xyz="""
Name:\tIsra
employee:\tHMB
employee id:\t13615
designation:\tBusiness Analyst:

"""

print(xyz.expandtabs(30))

Name:                         Isra
employee:                     HMB
employee id:                  13615
designation:                  Business Analyst:

In [25]:
name= "   syeda Isra Raza    "

name.lstrip()

'syeda Isra Raza    '

In [26]:
name= "   syeda Isra Raza    "

name.rstrip()

'   syeda Isra Raza'

In [27]:
name= "   syeda Isra Raza    "

name.strip()

'syeda Isra Raza'

In [30]:
name= "   syeda Isra Raza    "

name.replace("Isra","Bushra")

'   syeda Bushra Raza    '

In [31]:
name= "   syeda Isra Isra    "

name.replace("Isra","Bushra")

'   syeda Bushra Bushra    '

In [33]:
name= "   syeda Isra Isra Isra   "

name.replace("Isra","Bushra",1)

'   syeda Bushra Isra Isra   '

In [34]:
name= "   syeda Isra Isra Isra   "

name.replace("Isra","Bushra",2)

'   syeda Bushra Bushra Isra   '

In [44]:
text="""
1 139447 Shahina Tabassum 16102-2219857-6 Senior School Teacher 17 DEO (F) 23-Nov-15 16102-2313055-7 Qisar Khan Khattak 7000027203 HBL 2367 592,260 14-Nov-17
2 331166 Irum Jalal 17201-7460065-2 Labortory Attendent 4 DEO (F) 13-Nov-16 17201-2172499-9 Kashif Shah 1430-1 NBP 1637 194,503 14-Nov-17
3 389961 Miraj Khan 17301-7808672-9 Behishti 3 Gov House 2-Feb-17 17301-9938448-4 Khalida Bibi 7900499203 HBL 0225 194,503 14-Nov-17
4 42044 Shoaib 17301-8738046-3 Pump Operator 5 CM Sectt 4-Dec-15 17301-4701275-6 Najma Shaheen 0035-00-2 BoK 0156 295,112 14-Nov-17
5 781196 Hakeem Khan 15602-0176051-1 Driver 5 PEDO 18-Jan-16 15602-3619532-0 Roshan Jamila 77000015101 HBL 2476 294,736 14-Nov-17
6 3316 Fazli Mula 17101-0629293-9 EPI Technician 9 DHO 3-Jul-15 17101-0957019-0 Shah Haram 7901120603 HBL 0217 296,992 14-Nov-17
7 716338 Waqas Alam 11202-0354052-5 Tube Well Operator 6 Irrigaion 15-Sep-16 11201-0363972-9 Qibla Alam 4082176861 NBP 0964 291,559 14-Nov-17
8 342090 Nadir Khan 11201-0393094-5 Clincial Technician 16 DHQ 25-Oct-15 11201-0354693-2 Mst Bibi Hawa 0010035742960012 ABL 0617 444,504 26-Jan-18
9 298272 Noor Zarif Khan 14202-1319432-3 Operator 7 Public Health Eng 26-Oct-15 14202-1283832-0 Naraz Begum 7900217601 HBL 1596 295,864 14-Nov-17
10 502637 Fazli Subhan 17301-0623801-5 Artist 12 DGHS 21-Jan-16 17301-7954461-4 Mujahida Tabasum 4119118522 NBP 0388 392,920 26-Jan-18
11 44543 Abdul Qadeem 17301-15516787-1 Naib Qasid 4 Sport Cult Tour 16-Dec-15 17301-5577227-2 Naseema 228898999 UBL 1567 196,893 14-Nov-17
12 39276 Said Rahim 17301-1392679-3 Supervisor 8 Sport Cult Tour 27-May-17 15402-5114600-0 Shagufta Bibi 4143217281 NBP 0386 291,352 14-Nov-17
13 39724 Ikram Ullah 17301-1390563-5 Senior Scale Stenographer 16 CM Sectt 8-May-16 17301-1313422-6 Shaheen Begum 4136493602 NBP 0389 441,756 14-Nov-17
14 141772 Asia Shafi 17201-2091445-0 Primary School Head Teacher 15 DEO (F) 31-Jul-15 17201-2132421-1 Amir Zeb 7901550703 HBL 0222 395,189 14-Nov-17
15 302234 Unab Gul 14202-9153362-1 Chowkidar 4 Public Health Eng 13-Oct-15 14202-7958724-4 Khial Marjana 7900211903 HBL 1596 196,675 14-Nov-17
16 388296 Ihsan Ullah 13202-4343047-3 Watcher 7 Fisheries 17-Apr-16 13202-2975750-2 Bibi Amna 1242-0 BoK 134 293,232 26-Jan-18
17 136401 Noor Bahadar 17201-2290006-7 Chowkidar 2 DEO (F) 

"""

import re
import pandas as pd

text=text.replace("-","")
cnic=re.findall('\d{13}',text)
cnic=list(set(cnic))

print(len(cnic))
df= pd.DataFrame({"CNIC": cnic})
df.to_excel("class4_cnic_list.xlsx", index=False)
df

34

             CNIC
0   1420212838320
1   1610222198576
2   1320229757502
3   1730199384484
4   1730147012756
5   1420279587244
6   1120203540525
7   1720121724999
8   1730106238015
9   1730113134226
10  1730187380463
11  1120103639729
12  1720174600652
13  1730179544614
14  1120103546932
15  1560201760511
16  1730113926793
17  1720122900067
18  0010035742960
19  1730115516787
20  1560236195320
21  1710106292939
22  1730113905635
23  1420213194323
24  1540251146000
25  1320243430473
26  1730155772272
27  1610223130557
28  1720121324211
29  1710109570190
30  1730178086729
31  1720120914450
32  1120103930945
33  1420291533621

In [85]:
text="""
Shahina Tabassum 23-15 
Irum Jalal 13-16 
Miraj Khan 2-17 
hoaib 4-15 
Hakeem Khan 18-16 
Fazli Mula 3-15 
Waqas Alam 15-16 
Nadir Khan 25-15 
Noor Zarif Khan 26-15 
Fazli Subhan 21-16 
Abdul Qadeem 16-15 
Said Rahim 27-17 
Ikram Ullah 8-16 
Asia Shafi 31-15 
Unab Gul 13-15 
Ihsan Ullah 17-16 

"""

import re

names = re.findall("(.*) \d+-\d+",text)
names

['Shahina Tabassum',
 'Irum Jalal',
 'Miraj Khan',
 'hoaib',
 'Hakeem Khan',
 'Fazli Mula',
 'Waqas Alam',
 'Nadir Khan',
 'Noor Zarif Khan',
 'Fazli Subhan',
 'Abdul Qadeem',
 'Said Rahim',
 'Ikram Ullah',
 'Asia Shafi',
 'Unab Gul',
 'Ihsan Ullah']

In [136]:
text="""
1 139447 Shahina Tabassum 16102-2219857-6 Senior School Teacher 23-Nov-15 
2 331166 Irum Jalal 17201-7460065-2 Labortory Attendent 13-Nov-16
3 389961 Miraj Khan 17301-7808672-9 Behishti 2-Feb-17
4 42044 Shoaib 17301-8738046-3 Pump Operator 4-Dec-15 
5 781196 Hakeem Khan 15602-0176051-1 Driver 18-Jan-16
6 3316 Fazli Mula 17101-0629293-9 EPI Technician 3-Jul-15

"""

import re

#names = re.findall("(.*)\d+-\d+",text)
data = re.findall("(\d{1}) (\d{4,6}) (.*) (\d{5}-\d{7}-\d{1}) (.*?) (\d{1,2}-(.+?)-\d{1,2})",text)

data

[('1',
  '139447',
  'Shahina Tabassum',
  '16102-2219857-6',
  'Senior School Teacher',
  '23-Nov-15',
  'Nov'),
 ('2',
  '331166',
  'Irum Jalal',
  '17201-7460065-2',
  'Labortory Attendent',
  '13-Nov-16',
  'Nov'),
 ('3',
  '389961',
  'Miraj Khan',
  '17301-7808672-9',
  'Behishti',
  '2-Feb-17',
  'Feb'),
 ('4',
  '42044',
  'Shoaib',
  '17301-8738046-3',
  'Pump Operator',
  '4-Dec-15',
  'Dec'),
 ('5',
  '781196',
  'Hakeem Khan',
  '15602-0176051-1',
  'Driver',
  '18-Jan-16',
  'Jan'),
 ('6',
  '3316',
  'Fazli Mula',
  '17101-0629293-9',
  'EPI Technician',
  '3-Jul-15',
  'Jul')]

In [117]:
text="""
1 139447 Shahina Tabassum 16102-2219857-6 Senior School Teacher 23-Nov-15 
2 331166 Irum Jalal 17201-7460065-2 Labortory Attendent 13-Nov-16
3 389961 Miraj Khan 17301-7808672-9 Behishti 2-Feb-17
4 42044 Shoaib 17301-8738046-3 Pump Operator 4-Dec-15 
5 781196 Hakeem Khan 15602-0176051-1 Driver 18-Jan-16
6 3316 Fazli Mula 17101-0629293-9 EPI Technician 3-Jul-15

"""

import re
import pandas as pd

#names = re.findall("(.*)\d+-\d+",text)
data = re.findall("1 (\d{4,6}) (.*) Senior School Teacher (\d{1,2}-(.*)-\d{1,2})",text)

data=pd.DataFrame(data,columns=("ID","Name","CNIC","Date"))

data

       ID                              Name       CNIC Date
0  139447  Shahina Tabassum 16102-2219857-6  23-Nov-15  Nov

In [135]:
text="""
1 139447 Shahina Tabassum 16102-2219857-6 Senior School Teacher 23-Nov-15 
2 331166 Irum Jalal 17201-7460065-2 Labortory Attendent 13-Nov-16
3 389961 Miraj Khan 17301-7808672-9 Behishti 2-Feb-17
4 42044 Shoaib 17301-8738046-3 Pump Operator 4-Dec-15 
5 781196 Hakeem Khan 15602-0176051-1 Driver 18-Jan-16
6 3316 Fazli Mula 17101-0629293-9 EPI Technician 3-Jul-15

"""

import re
import pandas as pd

#names = re.findall("(.*)\d+-\d+",text)
data = re.findall("(\d{1}) (\d{4,6}) (.*) (\d{5}-\d{7}-\d{1}) (.*) (\d{1,2}-(.+?)-\d{1,2})",text)

data=pd.DataFrame(data)

data

   0       1                 2  ...                      4          5    6
0  1  139447  Shahina Tabassum  ...  Senior School Teacher  23-Nov-15  Nov
1  2  331166        Irum Jalal  ...    Labortory Attendent  13-Nov-16  Nov
2  3  389961        Miraj Khan  ...               Behishti   2-Feb-17  Feb
3  4   42044            Shoaib  ...          Pump Operator   4-Dec-15  Dec
4  5  781196       Hakeem Khan  ...                 Driver  18-Jan-16  Jan
5  6    3316        Fazli Mula  ...         EPI Technician   3-Jul-15  Jul

[6 rows x 7 columns]